package jp.Ken.history_app;

import android.annotation.SuppressLint;
import android.app.AlertDialog;
import android.content.DialogInterface;
import android.content.Intent;
import android.os.Bundle;

import androidx.annotation.NonNull;
import androidx.fragment.app.Fragment;
import androidx.fragment.app.FragmentManager;

import android.view.LayoutInflater;
import android.view.View;
import android.view.ViewGroup;
import android.widget.Button;
import android.widget.ImageButton;
import android.widget.TextView;

import java.util.ArrayList;
import java.util.Collections;
import java.util.Random;

/**
 * A simple {@link Fragment} subclass.
 * Use the {@link Fragment_7#newInstance} factory method to
 * create an instance of this fragment.
 */
public class Fragment_7 extends Fragment {

    // TODO: Rename parameter arguments, choose names that match
    // the fragment initialization parameters, e.g. ARG_ITEM_NUMBER
    private static final String ARG_PARAM1 = "param1";
    private static final String ARG_PARAM2 = "param2";

    private TextView q_count;
    private TextView q;
    private Button ans_A;
    private Button ans_B;
    private Button ans_C;
    private Button ans_D;
    private QuizSound quizSound;
    private ArrayList< String > remove_num;
    private boolean show = true;


    //正解を入れる
    private String rightAnswer;
    //正解数カウント
    private int rightAnswerCount;
    //問題数カウント
    private int quizCount = 1;

    //クイズ出題数
    //440
    static private int QUIZ_COUNT;
    private String alertTitle;

    final ArrayList<ArrayList<String>> quizList = new ArrayList <> (  );

    //問題数,問題,正解,選択肢１,選択肢2,選択肢３,選択肢4
    final String[][] quizData = {
            {"今から約700〜600万年前、アフリカに現れた最古の人類を何というか","猿人","原人","新人","旧人"},
            {"約250万年前から1万年ほど前に、地球は寒冷化し氷期と間氷期が繰り返された。この時期を一般に何時代というか","氷河時代","氷床時代","エール時代","ビカリア時代"},
            {"約200万年前に出現し、猿人に次ぐ段階の人類を何というか","原人","新人","旧人","亜人"},
            {"石を打ち欠いて作った石器をなんというか","打製石器","磨製石器","台形石器","オルドワン石器"},
            {"約20万年前に現在の人類の直接の祖先が現れた。これを何というか","新人","旧人","北京人","原人"},
            {"打製石器を使っていた、約1万年前までの時代を何というか","旧石器時代","新石器時代","古墳時代","先カンプリア時代"},
            {"石を磨いて作った石器をなんというか","磨製石器","台形石器","打製石器","オルドワン石器"},
            {"紀元前3000年頃、ナイル川流域で起こった文明を何というか","エジプト文明","中国文明","インダス文明","メソポタミア文明"},
            {"エジプト文明で使われた文字を何というか","象形文字","甲骨文字","くさび形文字","漢字"},
            {"紀元前3000年頃、チグリス・ユーフラテス川流域で起こった文明を何というか","メソポタミア文明","エジプト文明","中国文明","インダス文明"},
            {"中国文明は黄河流域で起こったが、この時使われた漢字のもととなる文字は何か","甲骨文字","ヒエログリフ","くさび形文字","漢字"},
            {"エジプト文明において、神として敬われた国王の墓として何が作られたか","ピラミッド","前方後円墳","アブシンベル","タージマハル"},
            {"メソポタミア文明で使われた文字を何というか","くさび形文字","ルーン文字","トンパ文字","象形文字"},
            {"ヨーロッパの方からみて「太陽ののぼる土地」という意味がある言葉で、古代文明が発生したエジプトとメソポタミアを含む地域は何とよばれたか","オリエント","ポリス","トロイア","オリエンタル"},
            {"紀元前2500年頃、インド北西部に起こった文明を何というか","インダス文明","マヤ文明","ミケーネ文明","メソポタミア文明"},
            {"仏教を説いたのは誰か","シャカ","イエス","ムハンマド","孔子"},
            {"イスラム教を説いたのは誰か","ムハンマド","アブラハム","ガンディー","孔子"},
            {"紀元前6世紀頃、儒学のもととなる教えを説いたのは誰か","孔子","始皇帝","孫武","卑弥呼"},
            {"紀元前3世紀、始皇帝の元で中国を統一した王朝を何というか","秦","高句麗","新羅","漢"},
            {"今から一万年ほど前からつくられるようになった、表面に網目のような模様がつけられた土器を何というか","縄文土器","土偶","弥生土器","千網式土器"},
            {"縄文時代からつくるられるようになった、浅く土を掘りその上に屋根をふきおろした住居を何というか","たて穴住居","地堀式住居","よこ穴住居","ふきおろし住居"},
            {"縄文時代の人々が、海岸や水辺に食べ物の残りかすなどを捨てた場所を何というか","貝塚","残飯","石塚","食塚"},
            {"縄文時代につくられた、主に女性の形をした土製の人形を何というか","土偶","女形","はにわ","土人形"},
            {"青森市の郊外で発掘された、縄文時代中期の代表的な遺跡を何というか","山内丸山遺跡","石見銀山遺跡","荒神谷遺跡","山大丸山遺跡"},
            {"弥生時代になると、大陸から何が伝わったか","稲作","火起こし","狩猟","焼畑"},
            {"稲を収穫するために使われた石器を何というか","石包丁","鋸鎌","がんづめ","ノコギリ"},
            {"縄文土器に比べるとうすくて硬めで縄文時代に使われた土器を何というか","弥生土器","青銅器","硬質土器","薄生地土器"},
            {"弥生時代に金属器が大陸から伝わったが、このうち祭などで使われたものは何か","青銅器","すず","鉄器","鋼器"},
            {"金属器のうち、斧やナイフ、農具、武器として使われたものは何か","鉄器","銅鐸","銅矛","銅鏡"},
            {"収穫した米などをねずみや湿気から防いで保存するためにつくられた倉庫を何というか","高床倉庫","米貯蔵庫","台上倉庫","床上倉庫"},
            {"大規模な環濠集落の跡が残る佐賀県にある遺跡は何か","吉野ヶ里遺跡","登呂遺跡","弥生町遺跡","板付遺跡"},
            {"いくつかある古墳の種類のなかで、四角形の前部分と円形の後部からなる代表的な形の古墳を何というか","前方後円墳","前方後方墳","上円下方墳","前円後方墳"},
            {"祭祀や魔除けなどのため、古墳のまわりに並べられていた素焼の焼物を何というか","はにわ","焼人形","はこにわ","土偶"},
            {"3世紀後半に現在の奈良盆地を中心に、王と豪族が連合してつくった政権を何というか","大和政権","倭政権","大王政権","弥生政権"},
            {"7世紀ごろから天皇と呼ばれるようになる大和政権の王のことを何というか","大王","名王","和王","大君"},
            {"紀元前1世紀におこり、朝鮮半島の北部を支配した国を何というか","高句麗","百済","新羅","伽耶"},
            {"4世紀ごろにおこり、朝鮮半島南東部を支配した国を何というか","新羅","百済","伽耶","唐"},
            {"4世紀ごろにおこり、朝鮮半島の南西部にあった国を何というか","百済","伽耶","唐","長安"},
            {"3世紀から7世紀頃に中国大陸や朝鮮半島から日本に移住した人々を何というか","渡来人","移住人","大陸人","渡陸人"},
            {"紀元前4世紀にギリシアを支配したマケドニアの王は誰か","アレクサンドロス大王","卑弥呼","始皇帝","イエス"},
            {"紀元前使後、日本の九州北部にあり中国に使いを送った国を何というか","奴国","倭国","鎖国","九国"},
            {"奴国がいを送った当時の中国の王朝名は何か","漢","隋","唐","清"},
            {"奴国の王が漢の皇帝から授かり、のちに福岡県の志賀島で発見されたものは何か","金印","漢印","王印","帝印"},
            {"中国の歴史書によると、当時の日本は何と呼ばれていたか","倭","和","日","武"},
            {"邪馬大国の女王である卑弥呼が使いを送った中国の国はどこか","魏","蜀","呉","志"},
            {"卑弥呼や邪馬台国に代表される古代日本の様子や、魏との関係が記されている中国で書かれた史書は何か","魏志倭人伝","漢書地理志","後漢東夷伝","魏志和人伝"},
            {"いくつかある古墳の種類のなかで、四角形の前部分と円形の後部からなる代表的な形の古墳を何というか","前方後円墳","前円後方墳","前方後方墳","上円下方墳"},
            {"祭祀や魔除けなどのため、古墳のまわりに並べられていた素焼の焼物を何というか","はにわ","土偶","はこにわ","焼人形"},
            {"3世紀後半に現在の奈良盆地を中心に、王と豪族が連合してつくった政権を何というか","大和政権","弥生政権","倭政権","大王政権"},
            {"7世紀ごろから天皇と呼ばれるようになる大和政権の王のことを何というか","大王","大君","名王","和王"},
            {"紀元前1世紀におこり、朝鮮半島の北部を支配した国を何というか","高句麗","百済","新羅","伽耶"},
            {"4世紀ごろにおこり、朝鮮半島南東部を支配した国を何というか","新羅","百済","伽耶","唐"},
            {"4世紀ごろにおこり、朝鮮半島の南西部にあった国を何というか","百済","伽耶","唐","長安"},
            {"3世紀から7世紀頃に中国大陸や朝鮮半島から日本に移住した人々を何というか","渡来人","移住人","大陸人","渡陸人"},
            {"590年代に初の女性の天皇として政治を行なった天皇は誰か","推古天皇","斉明天皇","持統天皇","皇極天皇"},
            {"6世紀末、長い間混乱が続いた中国を統一した王朝を何というか","隋","唐","漢","秦"},
            {"隋に代わり、７世紀初めに中国を統一した王朝を何というか","唐","漢","秦","呉"},
            {"6世紀末に物部氏を滅ぼし、強大な勢力をもつようになった豪族は誰か","蘇我氏","飛鳥氏","北条氏","藤原氏"},
            {"603年に定められた氏や姓にとらわれずに人材を登用するようにした制度を何というか","冠位十二階","武家諸法度","十七条憲法","氏姓不問"},
            {"604年に役人の心得を示すために、何をさだめたか","十七条憲法","冠位十二階","十七条心得","役人心得"},
            {"推古天皇の政治をたすける摂政という役職についたのは誰か","聖徳太子","中大兄皇子","蘇我馬子","殖栗皇子"},
            {"文化や制度を取り入れるために、聖徳太子が大陸に送った使節を何というか","遣隋使","遣唐使","遣漢使","遣大使"},
            {"遣隋使の最初の使節は誰か","小野妹子","中大兄皇子","中臣鎌足","佐野妹子"},
            {"聖徳太子がいた時代にさかえた文化を何というか","飛鳥文化","奈良文化","聖徳文化","大化文化"},
            {"現存する世界最古の木造建築物で、聖徳太子が建てたとされる寺院は何か","法隆寺","法観寺","明王寺","室生寺"},
            {"645年に起こった中央集権国家を作るための変革を何というか","大化の改新","大化の改革","中央の変革","集権の改新"},
            {"大化の改新で滅ぼされた豪族は何氏か","蘇我氏","物部氏","中臣氏","藤我氏"},
            {"大化の改新の中心人物で後に藤原氏となったのは誰か","中臣鎌足","中大兄皇子","中臣塊","藤原鎌足"},
            {"大化の改新でしめされた、土地と人民を国家の支配のもとにおく制度を何というか","公地公民","公民公地","独裁制","民地支配"},
            {"中大兄皇子は何天皇になったか","天智天皇","持統天皇","斉明天皇","皇極天皇"},
            {"天智天皇の死後、後継をめぐって起こった争いを何というか","壬申の乱","応仁の乱","天智の乱","承久の乱"},
            {"4世紀ごろ、朝鮮半島の南東部に建てられた国は何か","新羅","百済","高句麗","伽耶"},
            {"九州北部の防衛にあたった兵士を何というか","防人","守人","守衛","九兵"},
            {"701年にできた法律を何というか","大宝律令","宝化律令","大化律令","奈良律令"},
            {"法律国家のもとでは、戸籍に登録された6歳以上の人々に何が与えられたか","口分田","土地","お金","家畜"},
            {"口分田を与え、死ねば返させる制度を何というか","班田収授法","墾田永年私財法","班田返還法","口分田返還"},
            {"大宝律令には税が3種類あったが、稲を納める税を何というか","租","庸","調","稲"},
            {"大宝律令には税が3種類あったが、麻を納める税を何というか","庸","租","調","麻"},
            {"大宝律令には税が3種類あったが、特産物を納める税を何というか","調","租","庸","産"},
            {"地方の国ごとにおかれた役人を何というか","国司","都司","国人","国役"},
            {"710年に「唐」の都「長安」にならって、奈良につくられた都を何というか","平城京","平安京","平成京","平長京"},
            {"日本最古の貨幣としては「富本銭」などがあげれるが、広く流通した貨幣としては、708年につくられた何があるか","和同開珎","和銅開珎","永楽通宝","宋銭"},
            {"743年に出された、新しく開墾した土地の私有を認めた法律を何というか","墾田永年私財法","班田収授法","公地公民","新田永年私財法"},
            {"仏教の力にたよって国家を守ろうとした天皇は誰か","聖武天皇","文武天皇","持統天皇","天武天皇"},
            {"聖武天皇が奈良につくった大仏のある寺を何というか","東大寺","善光寺","法隆寺","薬師寺"},
            {"東大寺にある聖武天皇の宝物を収めた建物を何というか","正倉院","宝物庫","宝物院","東大宝庫"},
            {"正倉院の建て方を何というか","校倉造","正倉造","寝殿造","書院造"},
            {"九州におかれた役所を何というか","太宰府","防人","国司","都司"},
            {"日本にわたろうとして何度も遭難し、盲目になりながらも来日した唐の僧は誰か","鑑真","空海","行基","最澄"},
            {"奈良時代にできた最も古い歴史書を何というか","古事記","風土記","日本書紀","三国志"},
            {"地方の国ごとの自然、産物、伝説などを記したものは何か","風土記","日本書紀","三国志","太平記"},
            {"奈良時代にできた和歌集を何というか","万葉集","古今和歌集","新古今和歌集","後撰和歌集"},
            {"奈良時代に栄えた、唐の文化と仏教の影響を強く受けた文化を何というか","天平文化","奈良文化","唐仏文化","大平文化"},
            {"奈良時代に唐へ送った使いを何というか","遣唐使","遣隋使","唐使","送唐使"},
            {"聖武天皇と光明皇后は国ごとに何を建てたか","国分寺・国分尼寺","東大寺","薬師寺","善光寺"},
            {"784年に都を長岡京に移し、次いで794年に平安京に移し政治の立て直しをはかった天皇は誰か","桓武天皇","聖武天皇","推古天皇","天武天皇"},
            {"8世紀末に征夷大将軍に任命されたのは誰か","坂上田村麻呂","徳川家康","菅原道真","藤原道長"},
            {"9世紀の初めに唐にわたり帰国後、比叡山に延暦寺を建てたのは誰か","最澄","空海","行基","栄西"},
            {"最澄は何を伝えたか","天台宗","真言宗","浄土宗","日蓮宗"},
            {"最澄とともに唐にわたり帰国後、高野山に金剛峯寺を建てたのは誰か","空海","最澄","行基","鑑真"},
            {"空海は何を伝えたか","真言宗","浄土宗","日蓮宗","天台宗"},
            {"894年に遣唐使に任命されたのは誰か","菅原道真","菅原道長","藤原道長","藤原定家"},
            {"唐は10世紀の初めに滅び、小国の分立をへてやがて中国を統一したのはどこか","宋","高麗","西夏","遼"},
            {"9世紀後半以降に、藤原氏によって行われた政治を何というか","摂関政治","藤原政治","関白政治","大名政治"},
            {"天皇が小さいとき、天皇の代わりに政治を行う役職は何か","摂政","代理人","摂関","関白"},
            {"天皇が成人してから、天皇の代わりに政治を行う役職は何か","関白","摂政","代政","摂関"},
            {"11世紀前半に、子の藤原頼通とともに藤原氏の全盛時代を築いたのは誰か","藤原道長","藤原定家","藤原実定","藤原長道"},
            {"11世紀初め、紫式部は長編小説の何を書いたか","源氏物語","枕草子","平家物語","古今和歌集"},
            {"11世紀初め、清少納言は随筆の何を書いたか","枕草子","源氏物語","平家物語","土佐日記"},
            {"ひらがなやかたかなを何文字というか","かな文字","ひら文字","かた文字","にほん文字"},
            {"平安時代に紀貫之によってまとめられた和歌集は何か","古今和歌集","万葉集","新古今和歌集","拾遺和歌集"},
            {"紀貫之が女性を装って書いた日記を何というか","土佐日記","日本書記","平安日記","装飾日記"},
            {"平安時代の貴族の住宅の造を何というか","寝殿造","貴族院","平安造","書院造"},
            {"日本の風景や人物を描いた絵画を何というか","大和絵","日本絵","和絵","皇風絵"},
            {"枕草子の作者は誰か","清少納言","紫式部","紀貫之","松尾芭蕉"},
            {"源氏物語の作者は誰か","紫式部","清少納言","紀貫之","吉田兼好"},
            {"阿弥陀仏にすがり、極楽浄土に生まれ変わろうという信仰を何というか","浄土信仰","極楽信仰","阿弥陀信仰","不動信仰"},
            {"藤原頼通が京都の宇治に建てた阿弥陀堂を何というか","平等院鳳凰堂","中尊寺金色堂","三十三間堂","東求堂"},
            {"12世紀初め、東北地方の豪族「奥州藤原氏」によって平泉に建てられた阿弥陀堂を何というか","中尊寺金色堂","平等院鳳凰堂","三十三間堂","東求堂"},
            {"貴族や寺社の広大な私有地を何というか","荘園","公有地","貴園","荘院"},
            {"1185年に平氏が滅んだのはどこか","壇ノ浦","外ノ浦","下関","防府"},
            {"1192年に征夷大将軍となり、鎌倉幕府を開いたのは誰か","源頼朝","北条政子","平清盛","平将門"},
            {"将軍と主従関係を結んだ武士を何というか","御家人","用心棒","武家人","将武士"},
            {"鎌倉時代に国ごとにおかれ、軍事・警察の仕事をしたのは何という身分の人か","守護","百姓","商人","地頭"},
            {"鎌倉時代に荘園におかれ、年貢のといたてを行う仕事をしたのは何という身分の人か","地頭","荘人","集人","守護"},
            {"鎌倉幕府で将軍を助けて政治を行う役を何というか","執権","関白","院政","将助"},
            {"執権には代々、何氏がなったか","北条氏","源氏","藤原氏","徳川氏"},
            {"源頼朝の妻は誰か","北条政子","北条重時","北条敦子","北条滝子"},
            {"鎌倉幕府で御家人をまとめる役所を何というか","侍所","公文所","門注所","政所"},
            {"鎌倉幕府で訴えをさばく役所を何というか","門注所","公文所"," 侍所","政所"},
            {"鎌倉幕府で一般政務をする役所を何というか","政所","公文所"," 侍所","門注所"},
            {"御家人が将軍から領地をもらうことを何というか","御恩","奉公","御縁","譲渡"},
            {"御家人が将軍のために戦うことを何というか","奉公","御恩","心将","奉仕"},
            {"御恩と奉公から成り立つ将軍と御家人の関係を何というか","主従関係","上下関係","信頼関係","従属関係"},
            {"主従関係で結ばれた武士が、農民を支配する社会を何というか","封建社会","風化社会","縦社会","武士社会"},
            {"1221年に幕府を倒そうと兵をあげたのは誰か","後鳥羽上皇","平清盛","平将門","北条泰時"},
            {"後鳥羽上皇は1221年に幕府を倒そうと兵をあげた。この戦いは何と呼ばれたか","承久の乱","保元の乱","応仁の乱","源平の乱"},
            {"承久の乱の後、京都におかれた役所を何というか","六波羅探題","御成敗式目","武所","詰所"},
            {"1232年に出された日本初の武家法で、武家社会のならわしをまとめたものを何というか","御成敗式目","武家諸法度","武家目録","武家式目"},
            {"御成敗式目を制定した執権は誰か","北条泰時","北条泰家","北条政子","北条敦子"},
            {"13世紀にモンゴル民族をまとめ中国北方を支配したのは誰か","チンギス=ハン","ジンギス=カン","フビライ=ハン","マルコ=ポーロ"},
            {"チンギス=ハンが1206年に建国した国を何というか","モンゴル帝国","モンゴル大帝国","モンゴル共和国","モンゴル国"},
            {"モンゴル帝国の第五代目皇帝であり、元朝の初代皇帝は誰か","フビライ=ハン","チンギス=ハン","マルコ=ポーロ","モンケ=ハン"},
            {"フビライ=ハンが建国した国を何というか","元","漢","印","門"},
            {"東方見聞録の中で、日本を「黄金の国ジパング」として紹介したのは誰か","マルコ=ポーロ","フビライ=ハン","クトルン","ボクト=ハン"},
            {"マルコ=ポーロがイタリアに帰って書いた本を何というか","東方見聞録","ガリバー旅行記","漂流記","旅行日記"},
            {"元に服従させられた朝鮮の国を何というか","高麗","高句麗","大礼","元鮮"},
            {"1274年と1281年の2度にわたる元の日本襲来を何というか","元寇","文永の役","弘安の役","元の役"},
            {"元の襲来のときの執権は誰か","北条時宗","北条泰時","北条政子","平清盛"},
            {"元寇の後、生活が苦しくなった御家人を救うために出した法令を何というか","徳政令","特別例","改革令","困窮令"},
            {"鎌倉幕府を倒そうと兵をあげた天皇は誰か","後醍醐天皇","後鳥羽天皇","後白河天皇","光明天皇"},
            {"後醍醐天皇の行った天皇中心の政治を何というか","建武の新政","中央集権","天皇国家","王族制度"},
            {"後醍醐天皇にそむいて京都に新しい天皇をたて、再び幕府の政治をおこしたのは誰か","足利尊氏","足利義満","藤原道長","中臣鎌足"},
            {"後醍醐天皇は京都からどこへ逃れたか","吉野","紀伊","尾張","伊勢"},
            {"吉野と京都に二人の天皇がいた時代を何時代というか","南北朝時代","二天時代","双国時代","東西和時代"},
            {"南北中時代に守護は一国を支配する領主になっていくが、このような守護を何というか","守護大名","管領","守護領主","守護大公"},
            {"14世紀ごろ、元を滅ぼして中国を支配した国はどこか","明","清","漢","宋"},
            {"日本の海賊は何と呼ばれていたか","倭寇","バイキング","ならず者","倭族"},
            {"倭寇と区別するために正式な貿易船が持っていた割札を何というか","勘合","勘交","合札","重札"},
            {"日本と明の間で行った貿易を何というか","勘合貿易","日明貿易","倭寇貿易","勘交貿易"},
            {"日本と明の間の貿易を始めた将軍は誰か","足利義満","足利尊氏","徳川家康","足利直義"},
            {"室町幕府で将軍を助ける役職を何というか","管領","摂政","軍補","軍子"},
            {"室町幕府で関東を監視する役所を何というか","鎌倉府","太宰府","目付け","座"},
            {"14世紀末に高麗の後にできた国を何というか","朝鮮","韓国","新羅","百済"},
            {"商人や手工業者の作った同業者の組合を何というか","座","商","労集","商工"},
            {"寺社の門前などで開かれた市を何というか","定期市","神子市","闇市","寺院市"},
            {"室町時代の質屋で高利貸しを行っていたものを何というか","土倉","座","問丸","馬借"},
            {"室町時代に港にあった運送業者を何というか","問丸","海船","寄港","座"},
            {"室町時代に馬で荷物を運んだ運送業者を何というか","馬借","馬車","問屋","送馬"},
            {"村の運営のために、おきてなどを決めた会合を何というか","寄合","束集","村会","集村"},
            {"農村の自治組織を何というか","惣","全","一揆","郷"},
            {"1428年に農民が徳政令を要求して起こした乱を何というか","正長土一揆","山城の国一揆","嘉吉の徳政一揆","島原・天草の一揆"},
            {"下の身分の者が上の身分の者をたおすことを何というか","下克上","革命","挑戦状","掌握"},
            {"1467年に将軍の後継争いと守護大名の対立から京都でおきた戦乱を何というか","応仁の乱","承久の乱","源平の内乱","島原の乱"},
            {"応仁の乱の後、戦乱が100年近く続いた時代を何というか","戦国時代","安土桃山時代","戦乱時代","戦争100年時代"},
            {"守護大名の代わりに実力で領国を治めた大名を何というか","戦国大名","外様大名","譜代大名","軍師大名"},
            {"戦国大名が領国支配のために作った法律を何というか","分国法","配領","共国法","領分法"},
            {"琉球では、15世紀初めに尚氏が沖縄島を統一し首里城を都とする何を建国したか","琉球王国","モンゴル帝国","琉球大国","エイサー"},
            {"蝦夷地とは北海道以北で、主に何民族が住んでいた","アイヌ民族","ウィルタ民族","大和民族","山窩民族"},
            {"足利義満の時代の文化を何というか","北山文化","東山文化","南山文化","西山文化"},
            {"足利義政の時代の文化を何というか","東山文化","北山文化","南山文化","西山文化"},
            {"猿楽や田楽などの芸能をもとに、「観阿弥」と「世阿弥」親子は何を大成したか","能","狂言","歌舞伎","落語"},
            {"中国にわたり新しい絵の技法を学び、帰国後に日本の水墨画を完成させたのは誰か","雪舟","海舟","北斎","広重"},
            {"一寸法師などの絵入りの物語を何というか","御伽草子","仮名草子","浮世草子","枕草子"},
            {"能の合間に演じられた民衆の生活や感情を表現したものを何というか","狂言","歌舞伎","落語","浄瑠璃"},
            {"1543年に日本に伝わった武器は何か","鉄砲","大砲","剣","薙刀"},
            {"鉄砲を伝えたのはどこの国か","ポルトガル","モンゴル","朝鮮","中国"},
            {"鉄砲伝来の地はどこか","種子島","硫黄島","軍艦島","屋久島"},
            {"1549年に日本に伝わった宗教は何か","キリスト教","イスラム教","ヒンドゥー教","ユダヤ教"},
            {"キリスト教を日本に伝えたのは誰か","フランシスコ=ザビエル","イエスキリスト","マゼラン","マルコ=ポーロ"},
            {"フランシスコ=ザビエルは何という団体の一員であったか","イエスズ会","正教会","十字軍","カトリック教会"},
            {"キリスト教を保護し、自らが信者となった大名を何というか","キリシタン大名","キリスト大名","プロテスタント","ルネサンス"},
            {"日本の商人、南蛮人、中国人などとの間で行われていた貿易を何というか","南蛮貿易","多国籍貿易","朱印船貿易","勘合防衛"},
            {"14世紀にイタリアで始まった古典古代の文化を復興しようとする動きを何というか","ルネサンス","プロテクト","スパルタン","宗教改革"},
            {"ローマ教皇の権威が衰え、堕落した教会を改革しキリスト教本来の精神に戻ろうとする改革を何というか","宗教改革","キリスト改革","宗祖改革","革命改革"},
            {"宗教改革の中心人物となったのは誰か","ルター","コロンブス","マゼラン","フランシスコ=ザビエル"},
            {"自己の犯した罪の償いを免除されると信じられた、教皇が発行する証書を何というか","免罪符","太宰府","逃罪符","取除罪符"},
            {"ルターやカルバンらの、カトリック教会に反対して改革を進めた人々を何というか","プロテスタント","革命家","キリシタン","ルネサンス"},
            {"プロテスタントに対して、従来のキリスト教の教えを何というか","カトリック","ルネサンス","イエスズ","旧キリスト"},
            {"調味料や肉の保存料として、ヨーロッパに広まったアジアの特産物は何か","香辛料","山椒","甘味料","酸味料"},
            {"1492年に西インド諸島に到達したのは誰か","コロンブス","ドレーク","マゼラン","バスコ=ダ=ガマ"},
            {"1498年にアフリカの喜望峰を中継してインドへ到達したのは誰か","バスコ=ダ=ガマ","マゼラン","コロンブス","ドレーク"},
            {"1522年に世界一周を達成した船隊を率いていたのは誰か","マゼラン","バスコ=ダ=ガマ","コロンブス","ドレーク"},
            {"正式な貿易船であることを示す朱印状を携えた貿易を何というか","朱印船貿易","南蛮貿易","勘合貿易","日明貿易"},
            {"1637年に九州でおきたキリスト教徒の一揆を何というか","島原・天草一気","山城の国一揆","加賀の一向一揆","正長の土一揆"},
            {"今川義元を桶狭間の戦いで破ったあとに勢力を広げた尾張の戦国大名は誰か","織田信長","徳川家康","明智光秀","豊臣秀吉"},
            {"織田信長は鉄砲を使った戦いで、甲斐び武田勝頼を何の戦いで破ったか","長篠の戦い","壇ノ浦の戦い","関ヶ原の戦い","桶狭間の戦い"},
            {"島原の乱のときの将軍は誰か","徳川家光","徳川家康","徳川秀忠","徳川家綱"},
            {"仏教徒であることを寺院に保証させる制度を何というか","寺請制度","宗門改帳","生類憐みの令","寺保制"},
            {"仏教徒であることを寺院に保証させる制度で人々の名前は何に記録されたか","宗門改帳","聖書","公事方御定書","解体新書"},
            {"キリスト教の信者を発見するために用いた方法は何か","絵踏","踏絵","画踏","踏画"},
            {"1693年に日本への来航を禁止された国はどこか","ポルトガル","インド","モンゴル","朝鮮"},
            {"日本人の海外渡航を禁止し、外国との交際を制限した政策を何というか","鎖国","閉国","独立国","孤国"},
            {"江戸時代に鎖国政策の一環として造られた人工の島は何か","出島","開島","公島","貿島"},
            {"将軍が代わるごとに朝鮮から来た使いを何というか","朝鮮通信使","遣唐使","遣隋使","岩倉使節団"},
            {"1644年に明に代わって中国を支配した国を何というか","清","秦","漢","宋"},
            {"金貨や銀貨の質を落として幕府の財政難を切り抜けようとした5代将軍は誰か","徳川綱吉","徳川家綱","徳川家康","徳川家光"},
            {"5代将軍の出した極端な動物愛護の法律を何というか","生類憐みの令","動物愛護令","生類憐れみ制","動物保護令"},
            {"江戸幕府8代将軍は誰か","徳川吉宗","徳川家光","徳川綱吉","徳川綱吉"},
            {"徳川吉宗が行った政治改革を何というか","享保の改革","天保の改革","寛政の改革","天明のききん"},
            {"徳川吉宗が民衆の意見を聞くために江戸に置いたものを何というか","目安箱","ご意見箱","見聞箱","江戸箱"},
            {"徳川吉宗が作った裁判の基準となる法令集を何というか","公事方御定書","生類憐れみの令","宗門改帳","寺請制度"},
            {"徳川吉宗の後、18世紀後半に老中となったのは誰か","田沼意次","松平定信","水野忠邦","吉田松陰"},
            {"江戸時代に同業者どうしで結成された組合を何というか","株仲間","労働組合","同業仲間","商人集"},
            {"田沼意次の政治が乱れたのは大商人から何をもらったからか","わいろ","米","鉄砲","宝石"},
            {"田沼意次の政治の後に起きたききんを何というか","天明のききん","享保のききん","宝暦のききん","寛永のききん"},
            {"都市の町人が米商人をおそうことを何というか","打ちこわし","ぶっ壊し","百姓一揆","米騒動"},
            {"18世紀末、田沼意次に代わり老中となったのは誰か","松平定信","水野忠邦","吉田松陰","大塩平八郎"},
            {"松平定信の行った政治改革を何というか","寛政の改革","享保の改革","天保の改革","正徳の治"},
            {"松平定信が朱子学以外の学問を禁止した事を何というか","寛政異学の禁","異端審問","異学禁制","学問統一"},
            {"18世紀末ごろから日本沿岸にあらわれはじめた外国船に対して1825年に出された命令は何か","異国船打払令","異国船侵入禁止令","外国船排除令","外国船殲滅令"},
            {"1837年にもと大阪町奉行所の役人が中心となり、大阪で起こした反乱を何というか","大塩平八郎の乱","島原の乱","太平天国の乱","由井正雪の乱"},
            {"19世紀の中ごろ、江戸幕府の改革を行った老中は誰か","水野忠邦","松平定信","田沼意次","井伊直弼"},
            {"水野忠邦の行った改革を何というか","天保の改革","寛政の改革","享保の改革","田沼の改革"},
            {"外国人を打ち払えという論を何というか","攘夷論","殲滅論","異国論","打払論"},
            {"朝廷の権威を高めようという論を何というか","尊王論","朝威論","天皇論","上王論"},
            {"尊王攘夷が結びついた運動を何というか","尊王攘夷運動","攘夷運動","尊王運動","尊王攘夷結束運動"},
            {"井伊直弼が尊王攘夷の考えをとなえる人々を厳しく取り締まった事件を何というか","安政の大獄","桜田門外の変","紫衣事件"," 蛮社の獄"},
            {"1860年に井伊直弼が水戸浪士に暗殺された事件を何というか","桜田門外の変","安政の大獄","坂下門外の変","天誅組の変"},
            {"1866年ごろ、各地で起きた打ちこわしや一揆を何というか","世直し","世作り","打ちこわし","革命"},
            {"1867年に幕府は政権を天皇に返すと申し出たが、それを何というか","大政奉還","政権返還","大政返還","政権奉還"},
            {"旧幕府軍と新政府軍との戦いを何というか","戊辰戦争","下関戦争","西南戦争","日清戦争"},
            {"織田信長が今川義元を破った戦いを何というか","桶狭間の戦い","長篠の戦い","壇ノ浦の戦い","関ヶ原の戦い"},
            {"織田信長に追放された室町幕府最後の将軍は誰か","足利義昭","足利義政","足利尊氏","足利義満"},
            {"織田信長が琵琶湖のほとりに築いた城を何というか","安土城","姫路城","小田原城","大阪城"},
            {"織田信長が焼きうちにした天台宗の寺は何という寺か","延暦寺","鹿苑寺","慈照寺","東大寺"},
            {"織田信長が出した、自由に商工業ができる法令を何というか","楽市楽座令","極楽浄土","自由商業化","楽一楽座"},
            {"織田信長の跡を継いで全国統一を成し遂げたのは誰か","豊臣秀吉","徳川家康","明智光秀","狩野永徳"},
            {"豊臣秀吉は天皇の権利を利用するため、何という位についたか","関白","征夷大将軍","摂政","内大臣"},
            {"豊臣秀吉は田畑の面積や収穫高、土地の耕作者を調べたがこれを何というかあ","太閤検地","兵農分離","刀狩","禁中並公家諸法度"},
            {"豊臣秀吉は一揆を防ぐために農民から武器を取り上げたが、これを何というか","刀狩","武器狩","武器禁令","刀奪"},
            {"検地や刀狩で武士と農民を区別する政策を何というか","兵農分離","武農分離","兵農区別","武民選別"},
            {"茶の湯を大成させた人は誰か","千利休","シャクシャイン","松尾芭蕉","近松門左衛門"},
            {"歌舞伎踊りを始めたのは誰か","出雲の阿国","井原西鶴","本居宣長","大塩平八郎"},
            {"障壁画を大成させた人は誰か","狩野瑛永徳","雪舟","天草四郎","水野忠邦"},
            {"織田信長や豊臣秀吉の時代に栄えた、豪華で雄大な文化を何というか","桃山文化","国風文化","元禄文化","東山文化"},
            {"江戸時代の大名の領地とその支配のしくみを何というか","藩","荘園","株仲間","5人組"},
            {"関ヶ原の戦いの前から徳川氏の家臣であった大名を何というか","譜代大名","外様大名","親藩大名","キリシタン大名"},
            {"江戸幕府において、将軍のすぐ下にあって政治の運営にあたった役職を何というか","老中","大老","御用人","京都所司代"},
            {"江戸幕府は大名の統制のために何を定めたか","武家諸法度","参勤交代","公事方御定書","禁中並公家諸法度"},
            {"大名を1年おきに領地と江戸を往復させる制度を何というか","参勤交代","三勤交代","大名大移動","大名交代"},
            {"17世紀後半、アイヌ首長は誰か","シャクシャイン","コマシャイン","オニビシ","大河内善兵衛"},
            {"儒学のなかで、身分秩序を重視する学問を何というか","朱子学","蘭学","国学","古学"},
            {"日本永代蔵などの浮世草子を書いたのは誰か","井原西鶴","清少納言","雪舟","本居宣長"},
            {"曽根崎心中などの人形浄瑠璃の台本を描いたのは誰か","近松門左衛門","松尾芭蕉","十返舎一九","出雲の阿国"},
            {"紀行文の奥の細道を書いたのは誰か","松尾芭蕉","近松門左衛門","十返舎一九","井原西鶴"},
            {"日本の古典を研究し、日本古来の文化を明らかにしようとする学問は何か","国学","蘭学","古学","朱子学"},
            {"国学という学問を完成させたのは誰か","本居宣長","杉田玄白","孔子","前野良沢"},
            {"オランダ語を通してヨーロッパの文化を学ぼうとする学問は何か","蘭学","国学","古学","朱子学"},
            {"前野良沢や杉田玄白らは、ヨーロッパの解剖書を翻訳した何を出版したか","解体新書","解剖書","解体書","新解体書"},
            {"19世紀初めに、江戸を中心に栄えた文化を何というか","化政文化","元禄文化","桃山文化","国風文化"},
            {"日本国中を測量してまわり、初めて実測により日本地図を完成させた人は誰か","伊能忠敬","杉田玄白","松尾芭蕉","千利休"},
            {"浮世絵の風景画で富嶽三十六景を描いたのは誰か","葛飾北斎","ゴッホ","歌川広重","小林一茶"},
            {"浮世絵の風景画で東海道五十三次を描いたのは誰か","歌川広重","葛飾北斎","雪舟","ミケランジェロ"},
            {"子供たちに文字の読み・書き、場所によってはそろばんを教える庶民の教育施設のことを何というか","寺子屋","蔵屋敷","問屋","家屋"},
            {"イギリスのエリザベス1世やフランスのルイ14世などが行った専制政治を何というか","絶対王政","絶対王権","独裁政治","支配王政"},
            {"商工業者などの市民階級が、自由と平等を目指して国王の専制政治を倒した革命を何というか","市民革命","名誉革命","ピューリタン革命","フランス革命"},
            {"1642年にイギリスでクロムウェルが市民を率いて起こした革命を何というか","ピューリタン革命","フランス革命","市民革命","名誉革命"},
            {"1688年にイギリスで起こった、血を流さずに行われた改革を何というか","名誉革命","ピューリタン革命","市民革命","フランス革命"},
            {"1689年に、新国王とイギリス議会の間で結ばれた政治の取り決めを何というか","権利の章典","ハンムラビ法典","フランス民法典","連合王国の憲法"},
            {"法の精神により、司法・立法・行政の三権による三権分立を説いた啓蒙思想は誰か","モンテスキュー","ルソー","ロック","レッシング"},
            {"社会契約論により、人民主権の考えを説いた啓蒙思想は誰か","ルソー","ロック","モンテスキュー","レッシング"},
            {"1775年に、アメリカで起こった戦争を何というか","アメリカ独立戦争","南北戦争","クリミア戦争","米英戦争"},
            {"1776年にアメリカで、人間の平等、自由などが宣言される。この宣言を何というか","独立宣言","人権宣言","アメリカ宣言","開国宣言"},
            {"アメリカの初代大統領となった人物は誰か","ワシントン","リンカーン","トランプ","アダムズ"},
            {"1789年にパリの民衆がバスティーユ監獄を襲撃してい起こった革命を何というか","フランス革命","ピューリタン革命","市民革命","名誉革命"},
            {"フランス革命の革命の結果、何という宣言が出されたか","人権宣言","ポツダム宣言","独立宣言","開国宣言"},
            {"1804年、国民投票で皇帝となり、ヨーロッパの大部分を支配した人物は誰か","ナポレオン","ルイ14世","クロムウェル","シモン"},
            {"18世紀後半イギリスで始まった、技術の発達による産業と社会のしくみの変化を何というか","産業革命","グローバル化","高度経済成長","産業成長期"},
            {"資本家が労働者を雇い、利益を目的として、自由に生産を行っていくしくみを何というか","資本主義","社会主義","民主主義","完璧主義"},
            {"1871年にドイツ帝国の宰相ビスマルクによって進められた政策を何というか","鉄血政策","熱血政策","独裁政策","服属政策"},
            {"アメリカで1861年に起こった戦争を何というか","南北戦争","アメリカ独立戦争","太平洋戦争","アヘン戦争"},
            {"アメリカの南北戦争で、北部を勝利に導いた指導者は誰か","リンカーン","ワシントン","アダムズ","マディソン"},
            {"アメリカの南北戦争で、対立の焦点となっていた制度は何か","奴隷制度","人種制度","労働制度","植民地制度"},
            {"1840年にイギリスと清の間に起こった戦争は何か","アヘン戦争","南北戦争","英西戦争","クリミア戦争"},
            {"アヘン戦争の結果、何という条約が結ばれたか","南京条約","ポーツマス条約","下関条約","北京条約"},
            {"アヘン戦争後、洪秀全が農民を率いてつくった国を何というか","太平天国","満州国","中華人民共和国","清"},
            {"1857年、イギリスに対してインド国民が起こした大規模な反乱を何というか","インドの大反乱","インドの謀反","インドの大革命","インドの乱"},
            {"1866年、土佐藩の坂本龍馬の中立によって何が結ばれたか","薩長同盟","藩同盟","日英通商航海条約","日清修好条規"},
            {"1854年、幕府はアメリカとの間で何という条約を結んだか","日米和親条約","日英通商航海条約","樺太・千島交換条約","日清修好条規"},
            {"1858年、幕府はアメリカとの間で何という条約を結んだか","日米修好通商条約","日米和親条約","日英通商航海条約","樺太・千島交換条約"},
            {"1867年12月、朝廷は天皇を中心とする政治に戻すことを宣言したが、これを何というか","王政復古の大号令","大政奉還","版籍奉還","朝廷返還"},
            {"徳川家康が豊臣家を滅ぼした1614年と1615年の2度にわたる戦いを何というか","大坂の陣","関ヶ原の戦い","桶狭間の戦い","壇ノ浦の戦い"},
            {"江戸幕府の役職で、大名や朝廷を監視した職は何か","大目付","老中","大老","目付"},
            {"江戸幕府の役職で、老中の補佐と旗本や御家人を観察した職は何か","若年寄","目付","大老","老中"},
            {"明治時代に一部の藩の出身者によって行われた政治を何というか","藩閥政治","摂関政治","藩主政治","王権政治"},
            {"征韓論を唱え、政府をさった薩摩藩出身者は誰か","西郷隆盛","坂本龍馬","島津斉彬","西郷吉兵衛"},
            {"1877年に西郷隆盛が起こした乱を何というか","西南戦争"," 薩英戦争","東北戦争"," 秋田戦争"},
            {"1874年に政府に対して出された国会開設の要求を何というか","民撰議院開設の要求","国会開設の要求","議員開設要求","議院開設の要求"},
            {"国会開設の要求の中心人物は誰か","板垣退助","伊藤博文","森鴎外","西郷隆盛"},
            {"板垣退助が高知県に作った政治団体を何というか","立志社","イエスズ会","立憲同志会","帝国財政革新会"},
            {"板垣退助が中心となって行った運動を何というか","自由民権運動","自由民主運動","平和運動","国民運動"},
            {"1880年に自由民権運動の代表が作った、国会開設を要求する団体を何というか","国会期成同盟","国会要求組合","国会開設同盟","自由党"},
            {"板垣退助が作った急進的な議会政治をめざす政党を何というか","自由党","立憲改進党","憲政党","立憲革新党"},
            {"大隈重信が作った財産家を中心とする議会政治を理想とした政党を何というか","立憲改進党","憲政党","立憲革新党","自由党"},
            {"1884年に埼玉県で貧しい農民が起こした事件を何というか","秩父事件","相馬事件","大逆事件","大津事件"},
            {"明治政府は憲法を作るためにどこの憲法を調べたか","ドイツ","フランス","イギリス","アメリカ"},
            {"ドイツの国へ憲法を調べに行き、初代内閣総理大臣になったのは誰か","伊藤博文","板垣退助","福沢諭吉","黒田清隆"},
            {"日本での初めての憲法を何というか","大日本帝国憲法","日本国憲法","大日本憲法","帝国憲法"},
            {"日本と清との間に起きた戦争を何というか","日清戦争","日中戦争","清日戦争","日本清戦争"},
            {"日清戦争の翌年に結ばれた講和条約を何というか","下関条約","ポーツマス条約","樺太・千島交換条約","日米和親条約"},
            {"下関条約で日本が清からもらった領土はどこか","遼東半島","台湾","樺太","千島"},
            {"1899年に中国の人々が帝国主義諸国の侵略に反対してい起こした事件を何というか","義和団事件","秩父事件","大津事件","相馬事件"},
            {"1904年に起きた日本とロシアとの戦争を何というか","日露戦争","日清戦争","戊辰戦争","アヘン戦争"},
            {"1902年にロシアの南下をおさえるために日本と同盟を結んだ国はどこか","イギリス","フランス","アメリカ","ドイツ"},
            {"日露戦争後の講和条約を何というか","ポーツマス条約","樺太・千島交換条約","日米和親条約","下関条約"},
            {"ポーツマス条約で日本はロシアからどこの南半分をもらったか","樺太","千島","台湾","ハワイ"},
            {"1910年に日本は韓国に対して何をしたか","韓国併合","文化統制","借金","請求"},
            {"義和団事件の後、中国の近代化をすすめたのは誰か","孫文","毛沢東","孔子","孫正義"},
            {"孫文がかかげた指導方法を何主義というか","三民主義","民主主義","立憲主義","資本主義"},
            {"1911年に孫文が中心となって清を滅ぼした革命を何というか","辛亥革命","市民革命","名誉革命","ピューリタン革命"},
            {"清が滅んで中国に新しくできた国を何というか","中華民国","中華人民共和国","漢","明"},
            {"1894年にイギリスとの間で撤廃された不平等条約は何か","領事裁判権","関税自主権","外国人租借地","鉄道附属地"},
            {"1911年にアメリカとの間で回復された不平等条約は何か","関税自主権","領事裁判権","外国人租借地","鉄道附属地"},
            {"日清戦争の賠償金で作った製鉄所は何か","八幡製鉄所","釜石製鉄所","室蘭製鉄所","加古川製鉄所"},
            {"足尾銅山の公害反対運動を起こした国会議員は誰か","田中正造","伊藤博文","福沢諭吉","板垣退助"},
            {"三井・三菱・住友などの大企業を何というか","財閥","派閥","名家","最大手"},
            {"労働条件の改善を求めて、労働者が資本家に対して起こした争議を何というか","労働争議","労働戦争","労働会合","労働資本"},
            {"1910年に天皇暗殺を計画したとして、社会主義者を死刑にした事件を何というか","大逆事件","大津事件","義和団事件","秩父事件"},
            {"日本の伝統美術を復興した日本人は誰か","岡倉天心","福沢諭吉","森鴎外","西郷隆盛"},
            {"岡倉天心とともに日本の伝統美術を復興したアメリカ人は誰か","フェノロサ","ペリー","ゴッホ","ピカソ"},
            {"欧米の列強に対抗するため、経済を発展させ軍隊を強くしようとして進められた政策を何というか","富国強兵","鉄血政策","欧化政策","軍国政策"},
            {"1868年3月、新政府は新しい政治の方針として、天皇が神に誓うという形で何が出されたか","五箇条の御誓文","王政復古の大号令","版籍奉還","朝廷"},
            {"1873年、満20歳以上の男子に兵役の義務を負わせる何が出されたか","徴兵令","出兵令","総動員令","兵役令"},
            {"1873年、税収の安定をめざして、何が始められたか","地租改正","富国強兵","廃藩置県","徴兵令"},
            {"1869年、それまで藩主が治めていたいた土地と人民とを朝廷に返させる何が行われたか","版籍奉還","廃藩置県","王政復古の大号令","大政奉還"},
            {"政府は近代的な産業を育てる政策を行ったが、このことを何というか","殖産興業","近代産業","明治産業","欧化政策"},
            {"官営模範工場として群馬県に何が作られたか","富岡製糸場","八幡製鉄所","弦月工場","中京煉瓦工場"},
            {"学問のすすめを書いた人は誰か","福沢諭吉","森鴎外","樋口一葉","野口英世"},
            {"1871年、日本は清との間で対等な立場で何を結んだか","日清修好条規","日米和親条約","日米修好通商条約","下関条約"},
            {"国境が不明確であったロシアとの間では、1875年に何条約が結ばれたか","樺太・千島交換条約","英露協商","日露和親条約","樺太島仮規則"},
            {"琉球藩は1879年に何になったか","沖縄県","琉球王国","龍国","中華民国"},
            {"日本の文化・制度・風習などを西洋化することで、日本が文明国であることを欧米諸国に示そうとした政策は何か","欧化政策","欧米化","文明開化","明治維新"},
            {"ロシアがフランスとドイツとともに遼東半島の返還を日本に勧告したことを何というか","三国干渉","三帝同盟","遼東勧告令","遼東返還令"},
            {"1902年ロシアに対して利害を同じくする日本とイギリスは何を結んだか","日英同盟","三国同盟","日英通商航海条約","薩長同盟"},
            {"にごりえやたけくらべを書いたのは誰か","樋口一葉","ペリー","森鴎外","福沢諭吉"},
            {"舞姫などを書いたのは誰か","森鴎外","樋口一葉","福沢諭吉","フェノロサ"},
            {"1882年から1915年まで存続したドイツ、オーストラリア、イタリア間で結ばれた同盟は何か","三国同盟","日独伊三国同盟","三国協商","三帝同盟"},
            {"三国同盟のとった政策を何というか","3B政策","3C政策","3A政策","3D政策"},
            {"三国同盟に対してイギリスはフランスとロシアとの間で何を結んだか","三国協商","三帝同盟","防共協定","鋼鉄協約"},
            {"三国協商のとった政策を何というか","3C政策","3A政策","3B政策","3D政策"},
            {"サラエボ事件をきっかけに1914年に始まった戦争は何か","第一次世界大戦","第二次世界大戦","第一次バルカン戦争","第二次バルカン戦争"},
            {"1915年、日本が中国に出した要求を何というか","二十一カ条の要求","民撰議院開設の要求","十三カ条の要求","五十カ条の要求"},
            {"1917年に起きた世界最初の社会主義革命を何というか","ロシア革命","フランス革命","ピューリタン革命","市民革命"},
            {"ロシア革命の指導者は誰か","レーニン","スターリン","マレンコフ","フルシチョフ"},
            {"ロシア革命の結果、できた国は何か","ソビエト連邦社会主義共和国連邦","ロシア連邦","ロシア帝国","モスクワ大公国"},
            {"ロシア革命の広がりを恐れて日本は何をしたか","シベリア出兵","シベリア撤兵","米騒動","日独伊三国同盟"},
            {"パリで結ばれた第一次世界大戦の講和条約を何というか","ベルサイユ条約","パリ条約 ","ロンドン条約","ローザンヌ条約"},
            {"1920年、アメリカ大統領の提唱でつくられた国際機構は何か","国際連盟","国際連合","国際通貨基金","世界保健機関"},
            {"国際連盟結成のときのアメリカ大統領は誰か","ウィルソン","ケネディ","ルーズベルト","レーガン"},
            {"1921年に開かれた軍備縮小の会議は何か","ワシントン会議","ビルダーバーグ会議","ダボス会議","日米欧委員会"},
            {"1919年にドイツで制定された、当時最も民主的といわれた憲法は何か","ワイマール憲法","ドイツ国憲法","ドイツ基本法","ドイツ民主憲法"},
            {"1919年、朝鮮で起きた独立運動を何というか","三・一独立運動","五・四運動","護憲運動","自由民権運動"},
            {"1919年、中国でおきた講和条約反対運動を何というか","五・四運動","三・一独立運動","護憲運動","自由民権運動"},
            {"インドの独立運動の指導者は誰か","ガンジー","ウィルソン","ヒトラー","レーニン"},
            {"ガンジーの唱えた方針は何か","非暴力・不服従","非核化・不公平","非戦論・不道徳","非課税・不利益"},
            {"1918年に民衆が米の安売りを求めておこした暴動を何というか","米騒動","打ちこわし","米暴動","米争議"},
            {"米騒動が最初に起きたのは何県か","富山県","新潟県","北海道","秋田県"},
            {"女性の地位向上を目指して1911年に結成された組織は何か","青鞜社","全国水平社","立憲政友会","JA全国女性組織協議会"},
            {"青鞜社の中心となったのは誰か","平塚らいてふ","与謝野晶子","樋口一葉","岡本かの子"},
            {"部落差別解放を求めて1992年に結成された組織は何か","全国水平社","大政翼賛会","青鞜社","労働組合"},
            {"1923年におきた大地震は何か","関東大震災","昭和三陸地震","阪神・淡路大震災","釧路沖地震"},
            {"尾崎行雄らが議会中心の政治を求めた運動は何か","護憲運動","三・一独立運動","五・四運動","婦人参政権運動"},
            {"1918年、日本初の政党内閣を作ったのは誰か","原敬","伊藤博文","大隈重信","犬養毅"},
            {"原敬の政党を何というか","立憲政友会","日本共産党","社会民主党","自由民主党"},
            {"大正時代にさかんだった民主主義を求める動きを何というか","大正デモクラシー","五・四運動","三・一独立運動","婦人参政権運動"},
            {"1925年に成立した選挙法を何というか","普通選挙法","衆議院議員選挙法","公職選挙法","参議院議員選挙法"},
            {"普通選挙法で選挙権が与えられた人はどんな人か","満25歳以上男子","20歳以上","満25歳以上女子","満25歳以上"},
            {"普通選挙法と同時に制定された法律は何か","治安維持法","治安警察法","郵便法","食品衛生法"},
            {"白樺派で友情の作者は誰か","武者小路実篤","夏目漱石","福沢諭吉","志賀直哉"},
            {"白樺派で暗夜行路の作者は誰か","志賀直哉","芥川龍之介","武者小路実篤","小林多喜二"},
            {"羅生門などの作者は誰か","芥川龍之介","武者小路実篤","太宰治","小林多喜二"},
            {"プロレタリア文学者で蟹工船の作者は誰か","小林多喜二","夏目漱石","与謝野晶子","志賀直哉"},
            {"1925年には何の放送が始まったか","ラジオ","NHK","バラエティ","アニメ"},
            {"1925年に成立した治安維持法の当初の目的は何を取り締まるものだったか","共産主義","部落差別","立憲政友会","全国水平社"},
            {"1983年ドイツはどこを併合したか","オーストラリア","アイスランド","トルコ","アイルランド"},
            {"ドイツはソ連とどんな条約を結んだか","独ソ不可侵条約","日ソ中立条約","日ソ基本条約","ブエノスアイレス講和条約"},
            {"1949年に日本がドイツ・イタリアと結んだ軍事同盟は何か","日独伊三国同盟","三国同盟","三国協商","日独伊防共協定"},
            {"1941年に日本とソ連との間で結ばれた条約は何か","日ソ中立条約","日独伊三国同盟","独ソ不可侵条約"," 中ソ友好同盟相互援助条約"},
            {"1945年にクリミア半島ヤルタで開かれた連合国首脳による会議は何か","ヤルタ会談","ワシントン会議","ビルダーバーグ会議","ダボス会議"},
            {"1945年7月に連合国は日本に対して何を発表したか","ポツダム宣言","世界人権宣言","独立宣言","権利の章典"},
            {"広島に原爆が落とされたのはいつか","8月6日","8月9日","9月6日","9月8日"},
            {"長崎に原爆が落とされたのはいつか","8月9日","8月6日","9月6日","6月8日"},
            {"1945年8月8日に日本に宣戦したのはどこか","ソ連","フランス","中国","イギリス"},
            {"日本がポツダム宣言を受け入れ、降伏したのはいつか","8月15日","11月3日","5月3日","8月20日"},
            {"日本が占領した連合国軍の本部を何というか","連合国総司令部","連合総本部","重要連合本部","秘密連合国軍総本部"},
            {"連合国軍をアルファベットで何というか","GHQ","WHO","IMF","WTO"},
            {"連合国軍の最高司令官は誰か","マッカーサー","ガンジー","ヒトラー","ビスマルク"},
            {"政治活動の自由を認めるために廃止された法律は何か","治安維持法","普通選挙法","労働基準法","税関法"},
            {"1945年に選挙法が改正されたが、選挙権を与えられた人の資格は何か","満20歳以上男女","満18歳以上男女","満25歳以上男女","満30歳以上男女"},
            {"1945年制定の労働社の団結を認めた法律は何か","労働組合法","労働基準法","労働関係調整法","最低賃金法"},
            {"1947年制定の労働条件の最低基準を定めた法律を何か","労働基準法","労働組合法","労働安全衛生法","労働契約法"},
            {"財閥が持っていた株を分散させたことを何というか","財閥解体","財閥崩壊","財閥分解","財閥分散"},
            {"1947年大企業が利益を独占することを禁止した法律は何か","独占禁止法","治安維持法","製造物責任法","利益独占禁止法"},
            {"地主の土地を小作農民に解放する政策は何か","農地改革","3B政策","財閥解体","国体変革"},
            {"新しい日本の憲法を何というか","日本国憲法","ワイマール憲法","大日本国憲法","大日本帝国憲法"},
            {"日本国憲法はいつ公布されたか","1946年11月3日","1947年5月3日","1945年8月6日","1945年9月6日"},
            {"日本国憲法はいつ施行されたか","1947年5月3日","1946年11月3日","1945年8月6日","1945年9月6日"},
            {"日本国憲法で天皇の地位はどうなったか","日本の象徴","日本の友達","日本の皇帝","日本の王様"},
            {"1947年に制定された教育に関する法律は何か","教育基本法","学校教育法","地方教育行政法","私立学校法"},
            {"1951年日本が48カ国と結び独立を回復した条約は何か","サンフランシスコ平和条約","日ソ中立条約","独ソ不可侵条約","ワルシャワ条約 "},
            {"サンフランシスコ平和条約の条約と同時に日本がアメリカと結んだ条約は何か","日米安全保障条約","日米通商航海条約","日米修好通商条約","日米修好通商条約"},
            {"1956年に日本とソ連の間で発表された宣言は何か","日ソ共同宣言","世界人権宣言","日ソ独立宣言","ポツダム宣言"},
            {"1956年、日本はどこに加盟したか","国際連合","国際連盟","国際海事機関","国際海事機関"},
            {"日本が1960年から始めた経済優先の政策は何か","高度経済成長政策","治安維持法","独占禁止法","労働基準法"},
            {"1965年に日本が韓国と結んだ条約は何か","日韓基本条約","日韓大陸棚条約","日韓併合条約","サンフランシスコ平和条約"},
            {"熊本県の水俣市で起こった四大公害病は何か","水俣病","四日市ぜんそく","イタイイタイ病","新潟水俣病"},
            {"三重県の四日市で起こった四大公害病は何か","四日市ぜんそく","新潟水俣病","新潟水俣病","水俣病"},
            {"富山県で起こった四大公害病は何か","イタイイタイ病","水俣病","四日市ぜんそく","新潟水俣病"},
            {"新潟県で起こった四大公害病は何か","新潟水俣病","水俣病","イタイイタイ病","四日市ぜんそく"},
            {"1972年に日本が中国との間に発表した声明は何か","日中共同声明","日米共同声明","日ソ共同宣言","日中平和友好条約"},
            {"1972年にアメリカから日本に返還されたのはどこか","沖縄","ハワイ","北海道","樺太"},
            {"1973年に第四次中東戦争で原油価格が値上がりしたために起こった事態を何というか","石油危機","ブラックマンデー","リーマンショック","コロナショック"},
            {"1978年に日本と中国との間で結ばれた条約は何か","日中平和友好条約","日中共同声明","中朝相互援助条約","日清講和条約"},
            {"1986年に制定された、雇用に関しての男女の対等な立場を目指す法律は何か","男女雇用機会均等法","男女共同参画社会基本法","育児・介護休業法","労働者派遣法"},
            {"1995年に近畿地方で起きた大地震は何か","阪神淡路大震災","芸予地震","熊本地震 ","鳥取地震"},
            {"1999年に施行された男女が性別にかかわらず個性や能力を発揮できる社会を目指す法律は何か","男女共同参画社会基本法","男女雇用機会均等法","育児・介護休業法","普通選挙法"},
            {"2000年から始まった、少子高齢化に備え社会保障費を社会全体で支える制度は何か","介護保険制度","社会福祉制度","公的扶助制度","雇用保険制度"},
            {"アメリカ、イギリス、オランダなどによる日本に対する経済封鎖は各国の頭文字をとって何と呼ばれたか","ABCD包囲陣","EFGH包囲陣","IJKL包囲陣","MNOP包囲陣"},
            {"ドイツがポーランドのオシフィエンチムに作った強制収容所を何というか","アウシュビッツ収容所","バルドゥフォス収容所","ダッハウ収容所","ベウジェツ収容所"},
    };

    public Fragment_7 ( ) {
        // Required empty public constructor
    }

    /**
     * Use this factory method to create a new instance of
     * this fragment using the provided parameters.
     *
     * @param param1 Parameter 1.
     * @param param2 Parameter 2.
     * @return A new instance of fragment Fragment_7.
     */
    // TODO: Rename and change types and number of parameters
    public static Fragment_7 newInstance ( String param1 , String param2 ) {
        Fragment_7 fragment = new Fragment_7 ( );
        Bundle args = new Bundle ( );
        args.putString ( ARG_PARAM1 , param1 );
        args.putString ( ARG_PARAM2 , param2 );
        fragment.setArguments ( args );
        return fragment;
    }




    @Override
    public void onCreate ( Bundle savedInstanceState ) {
        super.onCreate ( savedInstanceState );
        if ( getArguments ( ) != null ) {
            // TODO: Rename and change types of parameters
            String mParam1 = getArguments ( ).getString ( ARG_PARAM1 );
            String mParam2 = getArguments ( ).getString ( ARG_PARAM2 );
        }
    }

    @Override
    public View onCreateView ( LayoutInflater inflater , ViewGroup container ,
                               Bundle savedInstanceState ) {
        // Inflate the layout for this fragment
        View v = inflater.inflate ( R.layout.fragment , container , false );

        //選択した問題数の値を受け取る
        QUIZ_COUNT = getArguments ().getInt ( "quiz_num" );

        //フラグメント内に保存されたデータを取得
        if ( savedInstanceState != null ){
            //一度表示された問題
            remove_num = savedInstanceState.getStringArrayList ( "remove_quiz" );
            //出題数
            quizCount = savedInstanceState.getInt ( "quiz_count" );
            //正解数
            rightAnswerCount = savedInstanceState.getInt ( "answer_count" );

            show = savedInstanceState.getBoolean ( "show" );

        }

        //正解・不正解　効果音
        quizSound = new QuizSound ( getActivity () );

        //ラベル、ボタン
        q_count = v.findViewById ( R.id.quizCount );
        q = v.findViewById ( R.id.question);
        ImageButton home_button = v.findViewById ( R.id.button10 );

        ans_A = v.findViewById ( R.id.ans_A );
        ans_B = v.findViewById ( R.id.ans_B );
        ans_C = v.findViewById ( R.id.ans_C );
        ans_D = v.findViewById ( R.id.ans_D );


        ans_A.setOnClickListener (Button_CheckAnswer);
        ans_B.setOnClickListener (Button_CheckAnswer);
        ans_C.setOnClickListener (Button_CheckAnswer);
        ans_D.setOnClickListener (Button_CheckAnswer);

        for (int i=0;i<quizData.length;i++){

            ArrayList<String> temArray = new ArrayList <> (  );

            temArray.add ( quizData[i][0] );//問題
            temArray.add ( quizData[i][1] );//正解 選択肢
            temArray.add ( quizData[i][2] );//選択肢
            temArray.add ( quizData[i][3] );//選択肢
            temArray.add ( quizData[i][4] );//選択肢
            temArray.add ( String.valueOf ( i ) );

            quizList.add ( temArray );
        }


        ShowQuestion ();

        //ホームボタン
        home_button.setOnClickListener ( Home_button );

        return v;
    }

    //出題済みの問題を配列から削除
    public void RemoveQuestion(){

        for (int i=0;i<remove_num.size ();i++){
            int num = Integer.parseInt ( remove_num.get ( i ) );
            quizList.remove ( num );
        }
    }

    @SuppressLint ( "SetTextI18n" )
    public void ShowQuestion(){
        //クイズカウント更新
        q_count.setText ( quizCount+"問" );

        if ( show ){

            //ランダムな数字を取得
            Random random = new Random (  );
            int Random_num = random.nextInt ( quizList.size ());

            ArrayList<String> quiz = quizList.get ( Random_num );

            //表示した問題の番号を記録
            remove_num = new ArrayList <> (  );
            remove_num.add ( ( quiz.get ( 5 ) ) ) ;
            quiz.remove ( 5 );

            //問題文を表示
            q.setText ( quiz.get ( 0 ) );
            //配列から問題文を削除
            quiz.remove ( 0 );

            //正解をrightAnswerにセット
            rightAnswer = quiz.get ( 0 );

            //正解と選択肢をシャッフル
            Collections.shuffle ( quiz );

            //選択ボタンに選択肢を表示
            ans_A.setText ( quiz.get ( 0 ) );
            ans_B.setText ( quiz.get ( 1 ) );
            ans_C.setText ( quiz.get ( 2 ) );
            ans_D.setText ( quiz.get ( 3 ) );

            //配列からクイズを削除
            quizList.remove ( Random_num );

        }else {
            int num1 = Integer.parseInt ( remove_num.get ( remove_num.size ()-1 ) );

            ArrayList<String> quiz = quizList.get (num1);

            //問題文を表示
            q.setText ( quiz.get ( 0 ) );
            //配列から問題文を削除
            quiz.remove ( 0 );

            //正解をrightAnswerにセット
            rightAnswer = quiz.get ( 0 );

            //選択ボタンに選択肢を表示
            ans_A.setText ( quiz.get ( 0 ) );
            ans_B.setText ( quiz.get ( 1 ) );
            ans_C.setText ( quiz.get ( 2 ) );
            ans_D.setText ( quiz.get ( 3 ) );

            RemoveQuestion ();
        }
    }


    private final View.OnClickListener Button_CheckAnswer = new View.OnClickListener ( ) {

        @SuppressLint ( "ResourceAsColor" )
        @Override
        public void onClick ( View v ) {

            //ダイアログ　タイトルカスタム　ラベル
            TextView title_view = new TextView ( getActivity () );
            //ダイアログ　メッセージカスタム　ラベル
            TextView msg_view = new TextView ( getActivity () );

            //どの解答が押されたか
            Button ans_button = v.findViewById ( v.getId ());
            String btN_text = ans_button.getText ().toString ();

            //正解か不正解か判定
            if ( btN_text.equals ( rightAnswer ) ){
                //　♪正解　
                quizSound.play_ct_ans ();
                //ダイヤログ表示 title
                title_view.setText ( "正解" );
                title_view.setTextColor ( getResources ().getColor ( R.color.white ) );
                title_view.setTextSize(24);
                title_view.setPadding(40, 10, 10, 10);
                title_view.setBackgroundColor(getResources().getColor ( R.color.red ));
                //正解数カウント
                rightAnswerCount++;
            }else {
                // ♪不正解
                quizSound.play_it_ans ();
                //ダイヤログ表示 title
                title_view.setText ( "不正解" );
                title_view.setTextSize(20);
                title_view.setTextColor ( getResources ().getColor ( R.color.white ) );
                title_view.setPadding(40, 10, 10, 10);
                title_view.setBackgroundColor(getResources().getColor ( R.color.blue ));

            }
            //ダイアログ　msg
            msg_view.setText ( "答え: "+rightAnswer );
            msg_view.setTextSize ( 20 );
            msg_view.setTextColor ( getResources ().getColor ( R.color.g_2 ) );
            msg_view.setPadding(20, 40, 20, 40);


            //ダイアログ作成
            AlertDialog.Builder builder = new AlertDialog.Builder(getActivity());
            builder.setCustomTitle ( title_view );
            builder.setView ( msg_view );
            builder.setPositiveButton ( "次へ" , new DialogInterface.OnClickListener ( ) {
                @Override
                public void onClick ( DialogInterface dialog , int which ) {
                    if ( quizCount==QUIZ_COUNT ){
                        //結果画面へ移動
                        Intent intent = new Intent ( getActivity (),ResultActivity.class );
                        intent.putExtra ( "RIGHT_ANSWER_COUNT",rightAnswerCount );
                        intent.putExtra ( "QUIZ_COUNT",quizCount );
                        startActivity ( intent );
                    }else {
                        show = true;
                        quizCount++;
                        ShowQuestion ();
                    }
                }
            } );

            //戻るボタン無効　フラグメントを閉じないようにする
            builder.setCancelable ( false );
            builder.show ();
        }
    };


    private final View.OnClickListener Home_button = new View.OnClickListener ( ) {
        @Override
        public void onClick ( View v ) {

            quizSound.play_next_bgm ();
            FragmentManager fragmentManager = getActivity ().getSupportFragmentManager ();
            Bundle bundle = new Bundle () ;
            bundle.putBoolean ( "Button_Check",true );
            fragmentManager.setFragmentResult ( "Button_Check",bundle );
            fragmentManager.popBackStack ();
        }
    };

    @Override
    public void onSaveInstanceState( @NonNull Bundle outState) {
        super.onSaveInstanceState(outState);
        //一度表示された問題　番号
        outState.putStringArrayList ( "remove_quiz",remove_num );
        //出題数
        outState.putInt ( "quiz_count",quizCount );
        //正解数
        outState.putInt ( "answer_count",rightAnswerCount );
        //
        outState.putBoolean ("show",false);

    }



}
